In [2]:
%pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp310-cp310-macosx_10_9_x86_64.whl.metadata (89 kB)
Collecting numpy>=1.22.4 (from pandas)
  Downloading numpy-2.1.2-cp310-cp310-macosx_10_9_x86_64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/jaquelinedicroce/Library/Python/3.10/lib/python/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Users/jaquelinedicroce/Library/Python/3.10/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp310-cp310-macosx_10_9_x86_64.whl (12.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 12.6/12.6 MB 13.3 MB/s eta 0:00:00a 0:00:01
Downloading numpy-2.1.2-cp310-cp310-macosx_10_9_x86_64.whl (21.2 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 21.2/21.2 MB 22.6 MB/s eta 0:00:00a 0:00:01
Using cached pytz-2024.2-py2.py3-none-any.whl (508 kB)
Using cached tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.1.2 pandas-2.2.3 pytz-2024.2 tzdata-2024.2
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import numpy as np

### PREPROCESAMIENTO

In [4]:
df = pd.read_csv('data/ds_salaries.csv')

df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [5]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [6]:
df.shape

(3755, 11)

In [7]:
df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [8]:
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [9]:
df.duplicated().sum()

np.int64(1171)

In [19]:
duplicados = df.value_counts()
duplicados

work_year  experience_level  employment_type  job_title           salary  salary_currency  salary_in_usd  employee_residence  remote_ratio  company_location  company_size
2022       SE                FT               Data Scientist      191475  USD              191475         US                  100           US                M               21
                                                                  141525  USD              141525         US                  100           US                M               21
2023       SE                FT               Data Engineer       129000  USD              129000         US                  0             US                M               13
                                                                  252000  USD              252000         US                  0             US                M               13
2022       SE                FT               Data Engineer       130000  USD              130000         US                  0             US                M               12
                                                                                                                                                                              ..
2020       EN                FT               Research Scientist  42000   USD              42000          NL                  50            NL                L                1
                             PT               Data Scientist      19000   EUR              21669          IT                  50            IT                S                1
                                              ML Engineer         14000   EUR              15966          DE                  100           DE                S                1
           EX                FT               Data Engineer       70000   EUR              79833          ES                  50            ES                L                1
           EN                FT               Data Analyst        72000   USD              72000          US                  100           US                L                1
Name: count, Length: 2584, dtype: int64

In [20]:
def mas_repetidos(df):
    df_duplicados = df[df.duplicated(keep=False)]
    df_agrupado = df_duplicados.groupby(df.columns.tolist()).size().reset_index().rename(columns={0: 'count'})
    df_ordenado = df_agrupado.sort_values(by='count', ascending=False)
    return df_ordenado

mas_repetidos(df)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,count
223,2022,SE,FT,Data Scientist,191475,USD,191475,US,100,US,M,21
201,2022,SE,FT,Data Scientist,141525,USD,141525,US,100,US,M,21
399,2023,SE,FT,Data Engineer,129000,USD,129000,US,0,US,M,13
441,2023,SE,FT,Data Engineer,252000,USD,252000,US,0,US,M,13
221,2022,SE,FT,Data Scientist,185900,USD,185900,US,0,US,M,12
...,...,...,...,...,...,...,...,...,...,...,...,...
510,2023,SE,FT,Data Scientist,239748,USD,239748,US,0,US,M,2
508,2023,SE,FT,Data Scientist,228000,USD,228000,US,0,US,M,2
507,2023,SE,FT,Data Scientist,225000,USD,225000,US,100,US,M,2
504,2023,SE,FT,Data Scientist,201000,USD,201000,US,0,US,M,2
503,2023,SE,FT,Data Scientist,200160,USD,200160,US,0,US,M,2

In [21]:
df.drop_duplicates(inplace=True)

In [22]:
df.shape

(2584, 11)

### EDA (Exploratory Data Analyst)

In [23]:
df.head(1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L

In [ ]:
#¿De que pais son la mayoria de compañias?

In [ ]:
#En que puesto se gana mas

In [ ]:
#Tipo de trabajo, pais de residencia donde mas se cobra?

In [ ]:
#¿El nivel de  experiencia es proporcional al salario?

In [ ]:
#¿Cuanto se cobra de media por cada nivel de experiencia?

In [ ]:
#¿En qué tamaño de compañía trabajan más?

In [ ]:
#¿Por que porcentage promedio se aumenta el salario entre nivel de experiencia?

In [ ]:
#¿En que pais se cobra  mas por tipo de empleo?

In [ ]:
#¿Which are experience level more required?